tap "homebrew/services"
tap "ngrok/ngrok"
tap "supabase/tap"

# CLI tools
brew "bash-completion"
brew "git"
brew "awscli"
brew "gh"
brew "jq"
brew "mkcert"
brew "nss"
brew "tree"
brew "uv"

# Ruby
brew "ruby-build"
brew "rbenv"

# Database
brew "postgresql@14"
brew "redis", restart_service: :changed

# Infrastructure
brew "tfenv"

# GUI apps
cask "ngrok"
cask "raycast"
cask "session-manager-plugin"

# VSCode extensions
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql-syntax"
vscode "hediet.vscode-drawio"
vscode "kaiwood.endwise"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "liviuschera.noctis"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "sdras.night-owl"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tinaciousdesign.theme-tinaciousdesign"
vscode "usernamehw.indent-one-space"
vscode "vincaslt.highlight-matching-tag"
vscode "vitest.explorer"
vscode "vunguyentuan.vscode-css-variables"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "yummygum.city-lights-theme"
